{
  "updated": "2026-02-26",
  "papers": [
    {
      "pmid": "41655584",
      "doi": "10.1016/S0140-6736(25)02276-7",
      "title": "Efimosfermin alfa (BOS-580) once per month in people with metabolic dysfunction-associated steatohepatitis with F2 or F3 fibrosis: results from a 24-week, randomised, double-blind, placebo-controlled, phase 2 trial.",
      "authors": ["Noureddin M", "Kowdley KV", "Odrljin T", "Bain G", "Zhao J", "Loomba R", "et al."],
      "journal": "The Lancet",
      "published": "2026-02-21",
      "abstract": "Efimosfermin alfa (BOS-580) is an FGF21 analogue dosed once monthly by subcutaneous injection. In this 24-week phase 2 RCT in patients with biopsy-confirmed MASH (F2/F3 fibrosis), efimosfermin was well tolerated with mostly mild-to-moderate GI side effects. No deaths or grade 3+ adverse events were observed. Results support continued development of monthly FGF21 analogue therapy for MASH-related fibrosis.",
      "relevance": "high",
      "tags": ["FGF21 analogue", "MASH", "clinical trial", "liver fibrosis", "pharmacology"]
    },
    {
      "pmid": "41733121",
      "doi": "10.1002/advs.202515575",
      "title": "Rapid Remodeling of the Human Gut Microbiome in Response to Short-Term Animal Product Restriction and Associations with Host Molecular Phenotypes.",
      "authors": ["Emmanouil C", "Anezaki M", "Simistiras A", "Glentis S", "Dimas AS", "et al."],
      "journal": "Advanced Science",
      "published": "2026-02-24",
      "abstract": "Multi-omics profiling (16S rRNA, metabolomics, proteomics) of 200 individuals alternating between omnivory and animal product restriction for religious reasons. Dietary restriction reduced microbial diversity and shifted one-third of bacterial genera. A diet-responsive module associated Negativibacillus with FGF21 and intermediate-density lipoproteins, suggesting FGF21 as a circulating mediator linking gut microbiome remodeling to host metabolic responses during protein/animal product restriction.",
      "relevance": "medium",
      "tags": ["dietary restriction", "gut microbiome", "FGF21", "multi-omics", "protein restriction"]
    },
    {
      "pmid": "41711840",
      "doi": "10.1007/s00210-026-05015-3",
      "title": "Decoding the mechanistic basis of liver-muscle communication in health and disease.",
      "authors": ["Gamil NM", "Elsayed HA", "Salah ET", "Mostafa HA", "El-Shiekh RA", "et al."],
      "journal": "Naunyn-Schmiedeberg's Archives of Pharmacology",
      "published": "2026-02-19",
      "abstract": "Comprehensive review of liver-skeletal muscle crosstalk via inflammatory mediators (TNF-α, IL-6), metabolic regulators (mTOR, AMPK), hepatokines, and myokines. FGF21 is mentioned as part of liver-heart crosstalk alongside IL-6/STAT3 signaling. Broad review with FGF21 as a peripheral reference point rather than a primary focus.",
      "relevance": "low",
      "tags": ["hepatokines", "FGF21", "liver-muscle axis", "review", "metabolism"]
    }
  ]
}
